[
	{
		"heading": "What Is Bitcoin?",
		"data": [
			"Bitcoin is a cryptocurrency, a virtual currency designed to act as money and a form of payment outside the control of any one person, group, or entity, and thus removing the need for third-party involvement in financial transactions. It is rewarded to blockchain miners for the work done to verify transactions and can be purchased on several exchanges.",
			"Bitcoin was introduced to the public in 2009 by an anonymous developer or group of developers using the name Satoshi Nakamoto. It has since become the most well-known cryptocurrency in the world. Its popularity has inspired the development of many other cryptocurrencies. These competitors either attempt to replace it as a payment system or are used as utility or security tokens in other blockchains and emerging financial technologies. Learn more about the cryptocurrency that started it all—the history behind it, how it works, how to get it, and what it can be used for.",
			"Launched in 2009, Bitcoin is the world's largest cryptocurrency by market capitalization. Unlike fiat currency, Bitcoin is created, distributed, traded, and stored using a decentralized ledger system known as a blockchain. Bitcoin's history as a store of value has been turbulent; it has gone through several boom and bust cycles over its relatively short lifespan. As the earliest virtual currency to meet widespread popularity and success, Bitcoin has inspired a host of other cryptocurrencies in its wake."
		]
	},
	{
		"heading": "Understanding Bitcoin",
		"data": [
			"In August 2008, the domain name Bitcoin.org was registered. Today, at least, this domain is WhoisGuard Protected, meaning the identity of the person who registered it is not public information.",
			"In October 2008, a person or group using the name Satoshi Nakamoto announced the Cryptography Mailing List at metzdowd.com: 'I've been working on a new electronic cash system that's fully peer-to-peer, with no trusted third party.' This now-famous white paper published on Bitcoin.org, entitled 'Bitcoin: A Peer-to-Peer Electronic Cash System,' would become the Magna Carta for how Bitcoin operates today.",
			"On Jan. 3, 2009, the first Bitcoin block was mined—Block 0. This is also known as the 'genesis block' and contains the text: 'The Times 03/Jan/2009 Chancellor on brink of second bailout for banks,' perhaps proof that the block was mined on or after that date, and maybe also as relevant political commentary.",
			"Bitcoin rewards are halved every 210,000 blocks. For example, the block reward was 50 new bitcoins in 2009. On May 11, 2020, the third halving occurred, bringing the reward for each block discovery down to 6.25 bitcoins.",
			"One bitcoin is divisible to eight decimal places (100 millionths of one bitcoin), and this smallest unit is referred to as a satoshi. If necessary, and if the participating miners accept the change, Bitcoin could eventually be made divisible to even more decimal places.",
			"Bitcoin, as a form of currency, isn't too complicated to understand. For example, if you own a bitcoin, you can use your cryptocurrency wallet to send smaller portions of that bitcoin as payment for goods or services. However, it becomes very complex when you try to understand how it works.",
			"Cryptocurrencies are part of a blockchain and the network required to power it. A blockchain is a distributed ledger, a shared database that stores data. Data within the blockchain are secured by encryption methods. When a transaction takes place on the blockchain, information from the previous block is copied to a new block with the new data, encrypted, and the transaction is verified by validators—called miners—in the network. When a transaction is verified, a new block is opened, and a Bitcoin is created and given as a reward to the miner(s) who verified the data within the block—they are then free to use it, hold it, or sell it.",
			"Bitcoin uses the SHA-256 hashing algorithm to encrypt the data stored in the blocks on the blockchain. Simply put, transaction data stored in a block is encrypted into a 256-bit hexadecimal number. That number contains all of the transaction data and information linked to the blocks before that block.",
			"Transactions are placed into a queue to be validated by miners within the network. Miners in the Bitcoin blockchain network all attempt to verify the same transaction simultaneously. The mining software and hardware work to solve the nonce, a four-byte number included in the block header that miners are attempting to solve. The block header is hashed, or randomly regenerated by a miner repeatedly until it meets a target number specified by the blockchain. The block header is 'solved,' and a new block is created for more transactions to be encrypted and verified."
		]
	},
	{
		"heading": "How to Mine Bitcoin",
		"data": [
			"Imagine that a company owns a server farm with 10,000 computers used to maintain a database holding all of its client's account information. This company owns a warehouse building that contains all of these computers under one roof and has full control of each of these computers and all of the information contained within them. This, however, provides a single point of failure. What happens if the electricity at that location goes out? What if its Internet connection is severed? What if it burns to the ground? What if a bad actor erases everything with a single keystroke? In any case, the data is lost or corrupted.",
			"What a blockchain does is to allow the data held in that database to be spread out among several network nodes at various locations. This not only creates redundancy but also maintains the fidelity of the data stored therein—if somebody tries to alter a record at one instance of the database, the other nodes would not be altered and thus would prevent a bad actor from doing so. If one user tampers with Bitcoin's record of transactions, all other nodes would cross-reference each other and easily pinpoint the node with the incorrect information. This system helps to establish an exact and transparent order of events. This way, no single node within the network can alter information held within it.",
			"Because of this, the information and history (such as of transactions of a cryptocurrency) are irreversible. Such a record could be a list of transactions (such as with a cryptocurrency), but it also is possible for a blockchain to hold a variety of other information like legal contracts, state identifications, or a company's product inventory."
		]
	},
	{
		"heading": "Transparency",
		"data": [
			"A variety of hardware and software can be used to mine Bitcoin. When Bitcoin was first released, it was possible to mine it competitively on a personal computer. However, as it became more popular, more miners joined the network, which lowered the chances of being the one to solve the hash. You can still use your personal computer as a miner if it has newer hardware, but the chances of solving a hash are individually are minuscule.",
			"This is because you're competing with a network of miners that generate around 220 quintillion hashes (220 exa hashes) per second. Machines, called Application Specific Integrated Circuits (ASICs), have been built specifically for mining—can generate around 255 trillion hashes per second. In contrast, a computer with the latest hardware hashes around 100 mega hashes per second (100 million).",
			"To successfully become a Bitcoin miner, you have several options. You can use your existing personal computer to use mining software compatible with Bitcoin and join a mining pool. Mining pools are groups of miners that combine their computational power to compete with the large ASIC mining farms.",
			"If you have the financial means, you could also purchase an ASIC miner. You can generally find a new one for around $20,000, but used ones are also sold by miners as they upgrade their systems. There are some significant costs such as electricity and cooling to consider if you purchase one or more ASICs.",
			"There are several mining programs to choose from and many pools you can join. Two of the most well-known programs are CGMiner and BFGMiner. When choosing a pool, it's important to make sure you find out how they pay out rewards, what any fees might be, and read some mining pool reviews."
		]
	},
	{
		"heading": "How Do You Buy Bitcoin?",
		"data": [
			"If you don't want to mine bitcoin, it can be bought using a cryptocurrency exchange. Most people will not be able to purchase an entire BTC because of its price, but you can buy portions of BTC on these exchanges in fiat currency like U.S. dollars. For example, you can buy bitcoin on Coinbase by creating an account and funding it. You can fund your account using your bank account, credit card, or debit card."
		]
	},
	{
		"heading": "How Is Bitcoin Used?",
		"data": [
			"Bitcoin was initially designed and released as a peer-to-peer payment method. However, its use cases are growing due to its increasing value and competition from other blockchains and cryptocurrencies.",
			"To use your Bitcoin, you need to have a cryptocurrency wallet. Wallets hold the private keys to the bitcoin you own, which need to be entered when you're conducting a transaction. Bitcoin is accepted as a means of payment for goods and services at many merchants, retailers, and stores. Brick-and-mortar stores that accept cryptocurrencies will generally display a sign that says “Bitcoin Accepted Here”; the transactions can be handled with the requisite hardware terminal or wallet address through QR codes and touchscreen apps. An online business can easily accept Bitcoin by adding this payment option to its other online payment options: credit cards, PayPal, etc.",
			"Investors and speculators became interested in Bitcoin as it grew in popularity. Between 2009 and 2017, cryptocurrency exchanges emerged that facilitated bitcoin sales and purchases. Prices began to rise, and demand slowly grew until 2017, when its price broke $1,000. Many people believed Bitcoin prices would keep climbing and began buying them to hold. Traders began using cryptocurrency exchanges to make short-term trades, and the market took off."
		]
	},
	{
		"heading": "Risks of Investing in Bitcoin",
		"data": [
			"Speculative investors have been drawn to Bitcoin after its rapid price appreciation in recent years. Bitcoin had a price of $7,167.52 on Dec. 31, 2019, and a year later, it had appreciated more than 300% to $28,984.98. It continued to surge in the first half of 2021, trading at a record high of over $69,000 in November 2021—it then fell over the next few months to hover around $40,000.",
			"Thus, many people purchase Bitcoin for its investment value rather than its ability to act as a medium of exchange. However, the lack of guaranteed value and its digital nature means its purchase and use carry several inherent risks. For example, many investor alerts have been issued by the Securities and Exchange Commission (SEC), the Financial Industry Regulatory Authority (FINRA), and the Consumer Financial Protection Bureau (CFPB) regarding Bitcoin investing."
		]
	}
]
